{"pages":[{"title":"UDOO Vision Docs","text":"","tags":"","url":"index.html"},{"title":"Introduction","text":"UDOO VISION UDOO VISION is the new PC created to run AI applications! On UDOO VISION you can run all the software available for the PC world, from gaming to video streaming, from graphical editors to professional development platforms, plus all the software for the Arduino™ Leonardo world, including all the sketches, libraries and the official Arduino™ Leonardo IDE. Thanks to the embedded Intel® HD Graphics 500 GPU, you can use all the OpenVINO™ toolkit to build projects which leverage the power of AI. UDOO VISION embeds two processors: a Quad Core 64-bit Apollo Lake family 14nm processor, designed for the PC domain (The Intel® Atom™ E39XX System-on-Chips (SoCs) comes with 1.6 GHz base frequency and with 64-bit instruction set and very low TDP. This single chip solution includes the memory controller, which gives support for up 32-bit Quad-Channel LPDDR4 2400 MT\/s Memory.) the Microchip ATmega32U4 8-bit AVR microcontroller, the same of Arduino® Leonardo. While the Apollo Lake processor can run all the Windows and Linux 64bit distros you want to use as desktop PC, the ATmega32U4 allows easy access to an Arduino™ Leonardo environment. Download the User Manual to have a more complete explanation of the UDOO VISION hardware. Soon will be published video tutorials on the UDOO website, to start using your new UDOO VISION board. If you have any trouble uploading the Arduino sketch running Linux, check the Linux Known issue - Sketch upload section in the Getting Started with Arduino Leonardo page. Heads up! In order to prevent damages to your board, remember to: Never provide more than 5V in input to the GPIOs of the Arduino Leonardo-compatible(Atmel® ATmega32U4). Never keep the board in touch with metal objects or surfaces while it is powered up. Power the board with a stabilized power supply (DC-jack with a standard 5.5mm\/2.1mm barrel jack, internal positive, Voltage 12V ± 5%, at least 3A). Do not use a NON-standard USB 3.0 peripheral. If you use a non-standard USB 3.0 peripheral with an external power plug, this could send current back to the UDOO VISION board with the risk of damage. Lineup UDOO VISION retail line up consists of two models, UDOO VISION X5 and UDOO VISION X7. Check the Board Versions section to see the differences between the two UDOO VISIONs. Technical specifications Processor: CPU Intel® Atom™ X7-E3950 up to 2.0 Ghz (X7 version) CPU Intel® Atom™ X5-E3940 up to 1.8 Ghz (X5 version) GPU: Intel® HD Graphics 500 series controller up to 700 MHz 18 Execution Units RAM: 8 GB LPDDR4 Quad-Channel (X7 version) 4 GB LPDDR4 Quad-Channel (X5 version) Microchip ATmega32U4 8-bit AVR RISC-based microcontroller. Video interfaces: 1x embedded DisplayPort 1x Mini DisplayPort++ (with CEC line using HDMI adapters) Storage: 64GB eMMC soldered on-board (X7 version) 32GB eMMC soldered on-board (X5 version) 1x M.2 Key B 2242\/3042\/2280 slot for SSD modules 1x SATA III 6Gb\/s connector 1x MicroSD slot Networking: 2x Gigabit Ethernet LAN interface 1x M.2 Key E slot for optional Wireless(WiFi+BT) Module 1x M.2 Key B WWAN Slot (Type 2260\/3042 modules accepted) Audio interfaces: HD Audio Codec Cirrus Logic CS4207 Microphone + Headphone Combo Connector (TRRS) 2x USB 3.0 Type-A sockets 1x miniSIM Card Slot** 12V (± 5%) DC Power Jack (standard 5.5mm\/2.1mm barrel jack: internal positive), at least 3A. RTC Battery Connector + RTC Coin Battery Bi-color Power Status LED Arduino™ Leonardo-Compatible through the standard Arduino™ Pins layout and compatible with Arduino™ shields. *Available on Pin Header **Same slot of MicroSD Visit the official accessories sections. Community Official web site www.udoo.org Official forum www.udoo.org\/forum Forums The official UDOO forums can be found at www.udoo.org\/forum The forum search facility has been tweaked to allow more general searching. Please do a search before making a post as the issue may already have been raised and answered. IRC channel There is an (unofficial) UDOO discussion channel on IRC. Using the IRC client of your choice, use server information: irc.freenode.net. Room name is #udoo. Social networks Facebook page Telegram group YouTube Twitter Instagram","tags":"","url":"Introduction\/Introduction.html"},{"title":"Overview","text":"BLOCK DIAGRAM FULL SPECS INTEL APOLLO LAKE SOC Processor Intel® Atom® X-series 64 bit 14 nm: Quad Core up to 2.00 GHz Core 4 Memory LPDDR4 soldered-down memory up to 8GB RAM quad-channel Graphics Intel® HD Graphics 500 GPU up to 700 MHz 18 execution units Video Interfaces 1x eDP, 1x miniDP++ connectors Mass Storage eMMC disk up to 64 GB soldered on board, standard SATA connector, M.2 Key B SSD slot, Micro SD card slot Networking Gigabit Ethernet connector, M.2 Key E slot for optional Wireless+BT modules, mini SIM connector for use of M.2 Key B modems USB 2 x USB 3.0 type-A sockets Audio Microphone + Headphone TRRS combo connector Multimedia HW Video decode: HEVC (H.265), H.264, JPEG\/MJPEG, VP9, MPEG2, VC-1 and WMV9 Serial Ports 2x UART ports Other Interfaces IR interface - GPIOs - signals on expansion connector Operating System Windows 10, 8.1, 7 64bit, Linux Board Dimensions picoITX form factor 72x100 mm (2.83” x 3.93”) ATMEL® ATMEGA32U4 MICROCONTROLLER Microcontroller Atmel® ATmega32U4 module Other Interfaces SPI Flash JTAG connector Arduino Pinout Easy to use with a custom 2 rows pinoutExpandable with I\/O shield to have the standard Arduino Pinout R3 Digital I\/O Pins up to 23x digital input\/output (7 PWM) Analog I\/O Pins 12 (10 Bits of resolution) Heads up! The communication between the Apollo Lake SoC and the Microchip ATmega32U4 module comes through a USB interface, exactly like an Arduino™ Leonardo board connected to an external PC.","tags":"","url":"Hardware_References\/Overview.html"},{"title":"Resources","text":"UDOO VISION Hardware and UEFI BIOS User Manual For a complete explanation of the UDOO VISION hardware you can download the UDOO VISION Hardware and UEFI User Manual Schematics Here you can find the schematics files of the UDOO VISION: Schematics","tags":"","url":"Hardware_References\/Resources.html"},{"title":"Board versions","text":"The main differences between the two versions of the UDOO VISION are shown in the following table. X5 X7 Processor Intel® Atom® X5-E3940 up to 1.8 GHz Intel® Atom® X7-E3950 up to 2.0 GHz RAM 8 GB LPDDR4 quad-channel 4 GB LPDDR4 quad-channel Graphics Intel® HD Graphics 500 GPU up to 700 MHz Intel® HD Graphics 500 GPU up to 700 MHz Storage eMMC 32GB eMMC storage 64GB eMMC storage For a detailed comparison of the two processors follow this link: Ark Intel® processors comparison: E3940 and E3950","tags":"","url":"Hardware_References\/Board_versions.html"},{"title":"Video Output","text":"The Graphic controller of the UDOO VISION is the integrated Intel® HD Graphics 500, with 12 execution units and 650 MHz clock speed. Decoding\/Encoding specification formats HW decoding HEVC(H.265), H.264, AVC, VC-1, VP8, VP9, JPEG HW encoding HEVC(H.265), H.264, VP8, AVC, JPEG Video Output Connectors The Intel® Atom® Apollo Lake E3900 series of SoCs can support up to three independent 4K Ultra HD displays. On the UDOO VISION board are exposed an embedded Display Port connector and a Multimode Display Port using a mini DP connector. eDP Connector On the bottom side of UDDO VISION is located the embedded Display Port connector. To use a display connected to this type of port, you need a connector type STARCONN p\/n 300E30-0110RA-G3 or equivalent. The maximum resolution available is 3840 x 2160 @60Hz. miniDP++ Connector On the UDOO VISION board, the Digital Display Interfaces #0 implements a multimode Display Port (DP++) interface. It can be used to support DP displays directly and, through an external adapter, also HDMI or DVI displays. The configuration of this interface in DP or HDMI\/DVI mode is automatic. The maximum available is 2560x1600 @ 60Hz. You can use this MiniDP++ to DP cable to connect to a DisplayPort display in 4k resolution. You can use this MiniDP++ to HDMI cable to connect to an HDMI display in FullHD resolution. To have 4k resolution from mDP to HDMI you need an active adapter.","tags":"","url":"Hardware_References\/Video_Output.html"},{"title":"Storage Options","text":"eMMC onboard Depending on the chosen model of UDOO VISION, your board is equipped with an eMMC storage memory up to 64GB to install your favorite OS. The eMMC use a SD 3.0 compliant interface. Heads up! As a flash-based storage device, excessive drive access, particularly write commands, reduces its life. Therefore, it is strongly suggested to NOT create a swap partition on the eMMC device. SATA Both Apollo Lake E3940 and E3950 processors embed a SATA Controller, which offers up to two SATA III 6.0 Gbps interfaces. Of these interfaces, one SATA channel is carried out to a standard male SATA connector, CN11 (the other SATA channel is available on the M.2 Key B socket). A dedicated power connector (CN10), can be used to power 2.5&quot; Hard Disk Drives (or Solid State Drives) connected to the SATA male connector. The dedicated power connector is a 4-pin male connector. You can find this cable in the SATA data and power cables for UDOO VISION kit. Heads up! To connect a 3.5&quot; Hard Drive you need to provide SATA +5V+12V combo power supply from an external source. μSD The SoCs used on UDOO VISION module offer a SD\/MMC 4.0 compliant interface, that can be used as a boot device and\/or to add another mass storages media other than the internal eMMC and the two SATA interfaces. This SD interface is carried to a standard μSD card slot (CN13), soldered on bottom side of the module, push-push type. M.2 SATA Slot: Socket 2 Key B type 3042\/2260 The mass storage capabilities of the UDOO VISION are completed by an M.2 SSD Slot, which allows plugging M.2 Socket 2 Key B Solid State Drives with SATA interface. The connector used for the M.2 SATA slot is CN14, which is a standard 75 pin M.2 Key B connector. On the UDOO VISION board there is also a Threaded Spacer which allows the placement of M.2 Socket 2 Key B SATA\/PCI-e modules in 2260 or 3042 sizes. For additional informations about M.2 connectors, look at the relative section.","tags":"","url":"Hardware_References\/Storage_Options.html"},{"title":"M.2 Connectors","text":"UDOO VISION features two M.2 connectors on the bottom of the board. M.2 Slot: Socket 2 Key B type 3042\/2260 and WWAN Slot The mass storage capabilities of the UDOO VISION are completed by an M.2 SSD Slot, which allows plugging M.2 Socket 2 Key B Solid State Drives with SATA interface. The connector used for the M.2 SATA slot is CN14, which is a standard 75 pin M.2 Key B connector, type LOTES p\/n APCI0087-P001A, H=8.5mm. On the UDOO VISION board there is also a Threaded Spacer which allows the placement of M.2 Socket 2 Key B SATA modules in 2260 or 3042 size. You can find officials M.2 SSD Transcend MTS600 in the UDOO Shop compatible with this connector. On this socket, il also possible to connect a WWAN module in 2260 or 3042 size. It allows you to connect to a cellular network using the connected SIM slot CN13. M.2 Connectivity Slot: Socket 1 Key E Type 2230 It is possible to increase the connectivity of the UDOO VISION board by using M.2 Socket 1 Key E connectivity modules (e.g., WiFi+Bluetooth module). The connector used for the M.2 Connectivity slot is CN15, which is a standard 75 pin M.2 Key E connector, type LOTES p\/n APCI0076-P001A, H=4.2mm. On the UDOO VISION board there is also a Threaded Spacer which allows the placement of M.2 Socket 1 Key E connectivity modules in 2230 size. You can find the official M.2 Wi-Fi Intel dual band AC + BT 4.2 5ghz + adhesive antenna in the UDOO Shop compatible with this connector.","tags":"","url":"Hardware_References\/M.2_Connectors.html"},{"title":"Official Accessories","text":"In the UDOO Shop you can also find some accessories for the UDOO VISION. M.2 Modules M.2 SSD Transcend MTS600 Buy it from the shop Capacity: 128GB\/256GB\/512GB Dimensions: 60.0mm × 22.0mm × 3.58mm (2.36&quot; x 0.87&quot; x 0.14&quot;) Weight: 6g (0.21 oz) Storage Media: MLC NAND Flash memory Operating Voltage: DC 3.3V±5% Operating Temperature: 0°C (32°F) to 70°C (158°F) For more info about this SSD module you can check the official Transcend page M.2 Wi-Fi Intel dual band AC + BT 4.2 5GHz + adhesive antenna Buy it from the shop The package includes: Wi-Fi AC and Bluetooth 4.2 module Intel® Dual Band Wireless Wi-Fi AC and Bluetooth 4.2 module (AC3168) Dimensions: 4.9 x 3.5 x 0.4 inches Weight: 8.5g (0.3 oz) M.2 compatible RF micro coax type connector 2x Antennas IPEX MFH-4 connector 10cm IPEX cable Adhesive backing on aerial plates For more info about this WiFi\/BT module you can check the datasheet from the Intel website Heads up! You need both the antennas to make the module works properly. Connect an antenna to the Main connector to enhance Wi-Fi signal. Connect an antenna to the Aux connector to enhance Bluetooth and BluetoothLE signal. Cables and Others CPU fan for UDOO VISION heatsink You don’t need a CPU fan for your ordinary activities, but the fan will help you out with complex projects that require a lot of power. The CPU fan is applied on the bottom part of the board. It has 3 pins and you can set up thresholds inside the BIOS to automate it. It’s pretty much plug-and-play. The fan is provided with the UDOO VISION itself for those that bought the board from Kickstarter, but it will come soon in the official shop! Cables and Power Supply MiniDP++ to HDMI - The miniDP++ to HDMI Passive Adapter lets you connect the UDOO VISION to a high definition (up to 1080p) monitors and projectors MiniDP++ to DP - The 2MT miniDP++ to DP Adapter lets you connect the UDOO VISION to a high definition (up to 4k) monitors and projectors SATA data and power cables for UDOO VISION - SATA data and power cables for UDOO VISION (CN18 and CN30 connectors) Power Supply EU 12V 3A for UDOO VISION (EU or USA) OUTPUT: 12V, 3A Jack Dimensions: (Inner diameter) 2.1mm - (Outer diameter) 5.5mm.","tags":"","url":"Accessories\/Official_Accessories.html"},{"title":"Linux","text":"UDOO VISION is a Single Board Computer built upon a Pico-ITX pocket-size form factor, based on the Intel® Atom® Apollo lake family of System-on-Chips (SoCs), a series of Quad Core SoCs with 64-bit instruction set and very low TDP. Thanks to the x86_64 instruction set, the UDOO VISION supports all the x86 Linux distribution for 32-bit(aka i386, IA-32, x86-32, x86_32) and 64-bit(aka x64, x86-64, x86_64). We suggest to always use a 64-bit OS version. Heads up! Please notice that total amount of 8GB of RAM of the UDOO VISION X7 version would be usable with 64-bit OS. Total amount of memory available with a 32-bit OS depends on the OS itself (usually less than 4GB unless the OS isn't using PAE). Famous Linux distributions Here you can find an unordered list of 10 of the most popular Linux distributions: Ubuntu: is probably the most well-known Linux distribution. Ubuntu is based on Debian, but it has its own software repositories. Much of the software in these repositories is synced from Debian’s repositories. Ubuntu 22.04 Jammy Jellyfish is the latest Ubuntu released version, even if it is not officially supported by OpenVINO™ Toolkit. To use such framework, download Ubuntu 20.04 Focal Fossa. Linux Mint is a Linux distribution built on top of Ubuntu. It uses Ubuntu’s software repositories, so the same packages are available on both. Originally, Mint was an alternative distribution loved mainly because it included media codecs and proprietary software that Ubuntu didn’t include by default. Debian is an operating system composed only of free, open-source software. The Debian project has been operating since 1993 — over 20 years ago! This widely respected project is still releasing new versions of Debian, but it’s known for moving much more slowly than distributions like Ubuntu or Linux Mint. This can make it more stable and conservative, which is ideal for some systems. Arch Linux is more old school than many of the other Linux distributions here. It’s designed to be flexible, lightweight, minimal, and to “Keep it Simple.” Keeping it simple doesn’t mean Arch provides tons of graphical utilities and automatic configuration scripts to help you set up your system. Instead, it means Arch dispenses with that stuff and gets out of your way. Fedora is a project with a strong focus on free software — you won’t find an easy way to install proprietary graphics drivers here, although third-party repositories are available. Fedora is bleeding edge and contains the latest versions of software. CentOS \/ Red Hat Enterprise Linux Red Hat Enterprise Linux is a commercial Linux distribution intended for servers and workstations. It’s based on the open-source Fedora project, but is designed to be a stable platform with long-term support. openSUSE \/ SUSE Linux Enterprise openSUSE is a community-created Linux distribution sponsored by Novell. Novell purchased SuSE Linux in 2003, and they still create an enterprise Linux project known as SUSE Linux Enterprise. Where Red Hat has the Fedora project that feeds into Red Hat Enterprise Linux, Novell has the openSUSE project that feeds into SUSE Linux Enterprise. Mageia \/ Mandriva Mageia is a fork of Mandriva Linux created in 2011. Mandriva — known as Mandrake before that — was once one of the great user-friendly Linux distributions. Slackware Linux is another institution. Founded in 1993, Slackware is the oldest Linux distribution that’s still maintained and putting out new releases today. Puppy Linux is another fairly well-known Linux distribution. Previous versions have been built on Ubuntu, but the latest is built on Slackware. Puppy is designed to be a small, lightweight operating system that can run well on very old computers. Others useful distributions: LibreELEC – Just enough OS for KODI Kodi is a free and open-source media player software application developed by the XBMC Foundation. LibreELEC (short for Libre Embedded Linux Entertainment Center) is a distro based on Kodi, is a non-profit fork of OpenELEC as an open source just enough OS (JeOS) Linux software appliance distro for Kodi. Lakka is a lightweight Linux distribution that transforms a computer into a full blown game console for retrogaming. To help choosing your favorite distro you can also check this linuxhint.com article. A very updated resource to watch &quot;which is the most used Linux Distro&quot; and to choose one is Distro Watch","tags":"","url":"Operating_Systems\/Linux.html"},{"title":"Windows","text":"UDOO VISION is a Single Board Computer built upon a Pico-ITX pocket-size form factor, based on the Intel® Atom® Apollo lake family of System-on-Chips (SoCs), a series of Quad Core SoCs with 64-bit instruction set and very low TDP. Thanks to the x86_64 instruction set, the UDOO VISION supports the Windows distribution for 32-bit(aka i386, IA-32, x86-32, x86_32) and 64-bit(aka x64, x86-64, x86_64). We suggest to always use a 64-bit Windows version. Heads up! Please notice that total amount of 8GB of RAM of the UDOO VISION X7 version would be usable only with 64-bit OS. Total amount of memory available with a 32-bit OS depends on the OS itself (less than 4GB, however). The supported version of Windows are: Microsoft® Windows 10 (64-bit) Microsoft® Windows 10 Enterprise (64-bit) Microsoft® Windows 10 IoT Core (32- \/64-bit) Heads up! If you have issues with the TRRS microphone in Windows® 10 try to install the Realtek High Definition Audio Codecs audio drivers from this page In order to download the latest updated versions of the Intel® devices drivers (e.g. Graphics HD drivers, chipset, wireless networking) we suggest to download and run the Intel® Driver &amp; Support Assistant for Windows®.","tags":"","url":"Operating_Systems\/Windows.html"},{"title":"Find IP Address","text":"Overview We’ll find out how to discover the IP address associated with your UDOO VISION. The IP address is a number that uniquely identifies a device in a network. It will be useful to know which IP your UDOO VISION is assigned to for connecting to it remotely. There are various way to find the private IP Address, so let’s get started. First method: Command Line If your UDOO VISION is connected to a screen, you can simply find the IP Address of the board using the tool exploited by the OS you are using. Linux Windows On a Linux distribution open a terminal and type: ip a This command will output informations related to both Ethernet and Wi-Fi status, including respective IP addresses, besides the loopback address. udooer@udoovision:~$ ip a 1: lo: &lt;LOOPBACK,UP,LOWER_UP&gt; mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1000 link\/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00 inet 127.0.0.1\/8 scope host lo valid_lft forever preferred_lft forever inet6 ::1\/128 scope host valid_lft forever preferred_lft forever 2: enp2s0: &lt;NO-CARRIER,BROADCAST,MULTICAST,UP&gt; mtu 1500 qdisc mq state DOWN group default qlen 1000 link\/ether 00:c0:08:9d:8f:87 brd ff:ff:ff:ff:ff:ff 3: eno1: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc mq state UP group default qlen 1000 link\/ether 00:c0:08:9d:8f:88 brd ff:ff:ff:ff:ff:ff altname enp3s0 inet 192.168.1.217\/24 brd 192.168.1.255 scope global dynamic noprefixroute eno1 valid_lft 85535sec preferred_lft 85535sec inet6 fe80::1e12:98b8:f21:ca6d\/64 scope link noprefixroute valid_lft forever preferred_lft forever 4: wlp1s0: &lt;BROADCAST,MULTICAST,UP,LOWER_UP&gt; mtu 1500 qdisc noqueue state UP group default qlen 1000 link\/ether 3c:58:c2:fa:6c:b6 brd ff:ff:ff:ff:ff:ff inet 192.168.0.104\/24 brd 192.168.0.255 scope global dynamic noprefixroute wlp1s0 valid_lft 7192sec preferred_lft 7192sec inet6 fe80::571d:74a6:d6c7:ed4b\/64 scope link noprefixroute valid_lft forever preferred_lft forever In this example the Ethernet IP address is 192.168.1.217 and the Wi-Fi IP address is 192.168.0.104. Alternatively, with older Linux distro, you can also use the command ifconfig. A quick way to find your IP address in Windows is by running the ipconfig command in a Command Prompt window. You’ll see your IP address in the IPv4 Address row beneath the name of your connection. Using Windows 10 you can right-click the Start button. In the Menu appeared click on Command Prompt an invoke the ipconfig command. --&gt; Second method: use the Fing - Network Tools Mobile App Fing is a network scanner app, which will help you to discover every device connected into your network. Simply go to the Android or Ios market, download and launch it. If UDOO VISION is properly connected to the same network your phone is (whether via Wi-Fi or ethernet), you should see it and discover its IP address. Link to the stores: Android Google Play and IOS App Store You'll find UDOO VISION connected through the GB Ethernet identified as Seco. If the board is connected to the Network through Intel Wi-Fi\/BT module you'll find it identified as Intel Third method: use your Router control panel Just connect to your router control panel: open your browser and type the IP address of your router. Usually this is 192.168.1.1 or 192.168.0.1 or 192.168.1.254. Once you’re prompted with a user and password login box, log in (if you’ve not changed them, there are good chances they would be: admin as both user and password). Navigate to the devices list, which can be called also status or manteinance, you should see your UDOO VISION with his IP address. Here you are. Now that you know your IP address, you can easily access your UDOO VISION.","tags":"","url":"Basic_Setup\/Find_IP_Address.html"},{"title":"Remote Terminal (SSH)","text":"You can use UDOO VISION as a Desktop PC, connected to 4K or UHD monitors, keyboard and mouse. This is probably the most used setup, but if you want you can communicate with the board in remote way, so long as you leaving the board connected to a network. Requirements A first condition to establish a SSH connection with your UDOO VISION is to have previously completed the tutorial about Find IP Address. A second condition is to install a SSH Server on your UDOO VISION system, and install an SSH Client on the PC from which you want to connect to UDOO VISION. SSH Server on UDOO VISION Choose the software for the OS you've installed on your UDOO VISION. Linux Windows On a Linux system we suggest to use OpenSSH Server. On Ubuntu\/Debian\/Linux Mint type the following command: $ sudo apt install openssh-server N.B: On Ubuntu you usually find the openssh-server already installed out of the box. On RHEL\/Centos\/Fedora type the following command: # yum -y install openssh-server On ArchLinux type the following command: # pacman -S openssh You can change some OpenSSH server configuration in the file \/etc\/ssh\/sshd_config. Make a copy of the original sshd configuration file first. sudo cp \/etc\/ssh\/sshd_config \/etc\/ssh\/sshd_config.backup sudo gedit \/etc\/ssh\/sshd_config Heads up! Take note of your Linux username and password. These will be required during the connection from the client. If you want to use another SSH Server different from OpenSSh, you can find a comparison of SSH Server here. On Windows you usually won't use the SSH connection to access a terminal, so we suggest to follow the docs on the next page to use a complete Remote Desktop (VNC) connection. SSH Client on the remote PC On the PC from which you want to connect to UDOO VISION choose the client for the OS you use. Linux Windows On a Linux system we suggest to use OpenSSH Client. On Ubuntu\/Debian\/Linux Mint type the following command: $ sudo apt install openssh-client N.B: On Ubuntu you usually find the openssh-server already installed out of the box. On RHEL\/Centos\/Fedora type the following command: # yum -y install openssh-clients On ArchLinux type the following command: # pacman -S openssh There are lots of valid SSH clients for Windows. We suggest to use MobaXterm, a complete enhanced terminal for Windows with X11 server, tabbed SSH client, network tools and much more. Another famous SSH client is PuTTY. Connection via SSH Once you have completed these steps, open your SSH client. For the sake of this example, we consider you're using PuTTY on Windows. Opening PuTTY a window will ask you to specify the destination you want to connect to. In the first blank space, named Host Name or IP address, type the IP Address of UDOO VISION. Eventually, a Windows Firewall popup could appear the first time you do this. If this happens, allow PuTTY to bypass the firewall. When the connection succeeds, a black window will appear. That is the terminal. It will ask you to enter your login credential. Type the name of the user , then press &quot;Enter&quot;. A new line will appear: &lt;username&gt;@&lt;IPAddress&gt;' password: Type the password of the username then press &quot;Enter&quot;. Heads up! Do not worry if you don't see what you type in the terminal: it's an expedient to hide your password to eventual onlookers. At this point you can use your terminal: Welcome to Ubuntu 20.04.4 LTS (GNU\/Linux 5.15.0-46-generic x86_64) * Documentation: https:\/\/help.ubuntu.com * Management: https:\/\/landscape.canonical.com * Support: https:\/\/ubuntu.com\/advantage 90 packages can be updated. 40 updates are security updates. Last login: Tue Aug 23 11:38:51 2022 from 192.168.1.143 udooer@udoovision:~$ Good job, mate: you are now connected to your UDOO Neo via SSH.","tags":"","url":"Basic_Setup\/Remote_Terminal_(SSH).html"},{"title":"Remote Desktop (VNC)","text":"You can use UDOO VISION as a Desktop PC, connected to 4K or UHD monitors, keyboard and mouse. This is probably the most used setup, but if you want you can communicate with the board in remote way, so long as you leaving the board connected to a network. Virtual Network Computing (VNC) is a graphical desktop sharing system that uses the Remote Frame Buffer protocol (RFB) to remotely control another computer. Basically VNC allows you to use your keyboard and mouse of your PC to interact with the graphical desktop environment of the UDOO VISION from remote. Requirements A first condition to establish a VNC connection with your UDOO VISION is to have previously completed the tutorial about Find IP Address. A second condition is to install a VNC Server on your UDOO VISION system, and install an VNC Client on the PC from which you want to connect to UDOO VISION. VNC Server (on UDOO VISION) A VNC server is a program that shares a desktop with other computers over the Internet. Choose the software for the OS you've installed on your UDOO VISION. Linux Windows On Linux you usually need to install a VNC Server. There are various alternatives. For example you can install one of these through the package manager of your Linux Distro or downloading from the official websites: x11vnc tightvncserver tigervnc realvnc Some distros comes with a functional preinstalled VNC Server, so you can check if the distro are you using already has a desktop sharing software. For example Vino is the default VNC server in Ubuntu to share your existing UDOO VISION desktop. Follow the instruction in the link to enable the desktop sharing feature. At this page you can find a list of the most common VNC Servers used in Ubuntu: Ubuntu VNC\/Servers. If you come across an encryption Vino error trying connecting follow this page. Vnc Vino Ubuntu Security fix Windows 10 comes with a Remote Desktop Server already installed. The PC must be running Windows 10 Pro\/Education\/Enterprise. If you Windows 10 version is the Home you can not access it remotely. You need to turn on the Remote Desktop feature on the UDOO VISION in this way: Right-Click the Start button and go to System In the Left Menu click on Remote settings Check the Allow remote connections to this computer radio button. For a higher level of security, check the Allow connections only from computers running Remote Desktop with Network Level Authentication(recommended) Click Apply and OK Now the Remote Desktop service is enabled an ready to accept remote connections. You can find other infos here. VNC Client on the remote PC Now you need to install a VNC Client on the PC from which you want to connect to UDOO VISION. Linux Windows There also are lots of valid VNC clients for Linux. For example, VNC Viewer, VNC® Viewer for Google Chrome™, TightVNC, TigerVNC. Choose the one you prefer and install it in the remote PC. Windows 10 comes with a VNC Client already installed. In the search box of the Windows taskbar, type Remote Desktop Connection to find it. In the Computer box you can use the IP Address or the Computer Name assigned to your UDOO VISION. We suggest to use IP Address. There also are lots of valid VNC clients for Windows. For example, MobaXterm, a complete enhanced terminal for Windows with X11 server, tabbed vnc client, network tools and much more. Other alternatives could be VNC Viewer, VNC® Viewer for Google Chrome™, TightVNC, TigerVNC. Connection via VNC Regardless of the system and software you are using all the VNC client will ask you to insert the IP Address of the UDOO VISION to connect with it. After the connection is established you will need to insert the credential, username and the password, of the user configured in the UDOO VISION Operating System.","tags":"","url":"Basic_Setup\/Remote_Desktop_(VNC).html"},{"title":"Understanding Linux Software Management And Installing","text":"Overview In this tutorial we'll take Ubuntu as example. Ubuntu, a linux based operating system, handles software management in a way you may not be used to. It is however, very convenient at the end of the day. Ubuntu features a repository system, which is a software collection stored on several servers, which you can access and install with few commands. This ensures that updating and installing software is easy, efficient and safe. To quote from Wikipedia: In software, a package management system, also called package manager, is a collection of software tools to automate the process of installing, upgrading, configuring, and removing software packages for a computer's operating system in a consistent manner. It typically maintains a database of software dependencies and version information to prevent software mismatches and missing prerequisites. Packages are distributions of software, applications and data. Packages also contain metadata, such as the software's name, description of its purpose, version number, vendor, checksum, and a list of dependencies necessary for the software to run properly. Upon installation, metadata is stored in a local package database. Ubuntu integrated software manager is a command-line tool called apt. Using it is very straight forwarding. Apt has it’s own repository list, stored in \/etc\/apt\/sources.list You can add or remove software sources by editing this file. To see its content just type: cat \/etc\/apt\/sources.list It is however suggested to edit this only if you know what you are doing. Before attempting to install a software from a repository, let’s update the apt cache. This is basically a database of all available software, that includes dependencies and version informations. To update: sudo apt update Then, let’s assume we want to install nano, a very useful and simple text-editor: sudo apt install nano We will be asked if we wish to continue, let’s reply yes. So, type y Apt will then download, unpack and install all file needed for us. Just wait a while and it will finish. Let’s assume then, we want to remove a program, for example vim (another text-editor) sudo apt remove vim Again, we reply yes typing y. Some other useful commands for apt, and system housekeeping, are: apt autoremove removes automatically packages that are no longer required apt clean deleted downloaded packages that are wasting disk space We can now use another package manager, with a graphical user interface, Synaptic, which is the default package manager in most Ubuntu versions. We’ll use apt to install synaptic apt install synaptic Once installed, we’ll find Synaptic Package Manager in the “Other” applications menu. Let’s open it. Type your root password, and enter. You can then, search and install every package you like, in a nice and user friendly environment. To start, we will enable more software sources than we have by default. To do this, go to settings then repositories and check all the repositories you wish to enable; typically you should be good enabling all software sources from the “Ubuntu Software” tab. Once done, close and hit reload, which is the same as apt update. When finished, you can start searching and browsing for thousands of different softwares, to install them simply tick the checkbox, select Mark for installation and hit apply. You have now at your disposal all the software you need to further expand UDOO VISION capabilities.","tags":"","url":"Cookbook_Linux\/Understanding_Linux_Software_Management_And_Installing.html"},{"title":"Linux Command Line Interface","text":"Overview Linux Command Line Interface, (CLI from now on) could be at first glance discouraging for the average Joe, since nowadays we are only used to Graphic Interfaces. But don’t let you down, using a command line shell could be, not only very useful, but also kind of funny. This Tutorial will help you move your first steps in the command shell environment. First, when a Command Line Interface could be useful for you? Remote Connection via SSH: SSH remote connection allows to interact with UDOO VISION without physical access to it. SSH is available only with command line interface. Using a minimal Linux Distribution without a graphical interface. Some Linux Distribution come without a Graphical User Interface, in order to maximize available resources. Command line interface is your only bet in this scenario Some power-users consider CLI the most convenient way to perform code execution and file-system operations. Even if you are not in this category, you may found out that CLI can be very fast when you get used to it. Showing up with your mates, the longest your CLI strings, the more rep you’ll get. So, let’s start this adventure with the very basic Linux commands: sudo Your first ally, allows users to run programs with the security privileges of root, or superuser.Its name is a concatenation of &quot;su&quot; (substitute user) and &quot;do&quot;, or take action . So, if you get an error message saying that “only root can do that”, just use the same command with preceeded by sudo. sudo In fewer words: sudo su This just enables root privileges once for all, without forcing you to type sudo everytime. It works until you close the shell you are working into. sudo su touch create an empty file touch nano open an handy text editor, to save and exit, press &quot;ctrl&quot; and &quot;x&quot;, and tell yes or no by pressing &quot;y&quot; or &quot;n&quot; nano cat cat shows the content of a file, it speeds up file inspection for smaller files. cat \/etc\/hostname ls Shows you the content of a folder ls cd opens a specific folder cd \/home cd ubuntu cd .. Brings you to a higher folder level cd \/home\/ubuntu cd .. # this goes to the \/home\/&lt;user&gt; folder cd \/ brings you to root (top filesystem level) cd \/ rm deletes a file rm myfile.my rm -rf deletes a folder rm -rf \/home\/ubuntu\/myfolder rm -rf myfolder mv moves a file or a folder. Useful for renaming also mv myfile \/myfolder\/myfile mv myfile mysecondfile cp copies a file cp myfile \/home\/ubuntu\/ cp -R copies a folder cp -R myfolder \/home\/ubuntu\/myfolder mkdir creates a folder mkdir myfolder top Top is a very useful utility, it basically gives you a complete overview of the system’s status. It produces an ordered list of running processes selected by user-specified criteria. Top shows how much processing power and memory are being used, as well as other information about the running processes. top df -h Shows used and available disk space, in megabytes. df -h ifconfig -a Shows networking useful data, like current ip, netmasks and other statistics. ifconfig -a chmod chmod let you set files permissions. This utility is very important for people concerned about security, but it is useful also for coders, since you can set a script as executable with it . For a more comprehensive guide on how to use chmod see here dmesg Shows the messages resulting from the most recent system boot. It is useful for troubleshooting, since you can see which modules are loaded, which binaries are started and so on. dmesg sync Thanks to this command your SD card lifespan will drastically improve, remember to launch it every time you turn UDOO DUAL\/QUAD off, or remove the power. Completes all pending input\/output operations. It must be launched as root, or with sudo. sync reboot reboots the system reboot shutdown shuts it down shutdown now","tags":"","url":"Cookbook_Linux\/Linux_Command_Line_Interface.html"},{"title":"OpenVINO toolkit installation","text":"OpenVINO™ toolkit The UDOO VISION board is equipped with an Intel® HD Graphics 500 GPU which is fully supported by the OpenVINO™ toolkit, an open-source framework for optimizing and deploy AI inference. By looking at the Get Started page, you can retrieve all the information you need to install and start playing with the Intel toolkit. Get started Here are reported a non-exhaustive list of commands to perform a common installation of OpenVINO version 2021.4.689.\\ This installation has been succesfully performed on Ubuntu 20.04. First of all, install latest update and then install the dependencies sudo apt update sudo apt upgrade sudo apt install software-properties-common apt-utils wget curl cpio lsb-release build-essential vim usbutils cmake rsync openssh-client openssh-server libgtk-3-dev htop sudo python3.8 python3-virtualenv python3-pip libssl-dev qt5-default qtbase5-dev git libusb-dev libmosquittopp-dev libgflags-dev libqt5websockets5-dev zlib1g-dev Then actually install the toolkit curl https:\/\/apt.repos.intel.com\/openvino\/2021\/GPG-PUB-KEY-INTEL-OPENVINO-2021 | sudo apt-key add - echo &quot;deb https:\/\/apt.repos.intel.com\/openvino\/2021 all main&quot; | sudo tee \/etc\/apt\/sources.list.d\/intel-openvino-2021.list sudo apt update sudo apt install intel-openvino-dev-ubuntu20-2021.4.689 Finally install external dependencies and setup the environment so that the the framework will be automatically loaded when new terminal are opened for the current user cd \/opt\/intel\/openvino_2021\/install_dependencies sudo -E .\/install_openvino_dependencies.sh -y sudo -E .\/install_NEO_OCL_driver.sh -y bash -c 'echo -e &quot;\\n\\n# Loading OpenVINO variables\\nsource \/opt\/intel\/openvino_2021\/bin\/setupvars.sh\\n&quot;' &gt;&gt; $HOME\/.bashrc","tags":"","url":"Cookbook_Linux\/OpenVINO_toolkit_installation.html"},{"title":"Overview","text":"UDOO VISION embeds a Microchip ATmega32u4 microcontroller, the same as Arduino® Leonardo, with the same open-source schematic. The main Intel™ Atom® processor and the ATmega32u4 microcontroller are connected through an internal USB serial connection, so it’s exactly like having an Arduino® Leonardo connected with a standard PC but all in a small form factor Single Board Computer. The ATmega32u4 microcontroller is a low-power Microchip 8-bit AVR RISC-based microcontroller featuring 32KB self-programming flash program memory, 2.5KB SRAM, 1KB EEPROM, USB 2.0 full-speed\/low speed device, 12-channel 10-bit A\/D-converter, and JTAG interface for on-chip-debug. The device achieves up to 16 MIPS throughput at 16 MHz. 2.7 - 5.5 Volt operation. More technical information about ATmega32u4, like the datasheet, can be found in the Microchip ATmega32u4 page. From the Arduino Leonardo page: The Arduino Leonardo is a microcontroller board based on the ATmega32u4 (datasheet). It has 20 digital input\/output pins (of which 7 can be used as PWM outputs and 12 as analog inputs), a 16 MHz crystal oscillator, a micro USB connection, a power jack, an ICSP header, and a reset button. It contains everything needed to support the microcontroller; simply connect it to a computer with a USB cable or power it with a AC-to-DC adapter or battery to get started. The Leonardo differs from all preceding boards in that the ATmega32u4 has built-in USB communication, eliminating the need for a secondary processor. This allows the Leonardo to appear to a connected computer as a mouse and keyboard, in addition to a virtual (CDC) serial \/ COM port. It also has other implications for the behavior of the board; these are detailed on the getting started page.","tags":"","url":"Arduino_Leonardo_compatible(ATmega32U4)\/Overview.html"},{"title":"Getting Started with Arduino Leonardo","text":"To start programming the Arduino® Leonardo-compatible embedded microcontroller of the UDOO VISION you need the Arduino IDE or the Arduino Web IDE. You can refer to the Getting Started with the Arduino Leonardo page on Arduino®'s website. The getting started Arduino page will guide you through the installation of the IDE, Drivers, first example and everything you need to program the Arduino Leonardo and how to use the pinout. You can also find useful tutorials and a useful &quot;please read...&quot; section with lot of specific information for Arduino Leonardo. USB Devices The USB serial device where you can find the Arduino Leonardo-compatible (ATmega32U4) embedded may vary in accordance with the number of USB devices connected to the board. Usually, you should find the Arduino Leonardo-compatible in the COM3 in Windows 10 and \/dev\/ttyACM0 in Unix\/Linux OS. Linux Installation There are known issues with the Arduino® IDE on Linux that can lead to malfunctions and difficulties in uploading sketches. These known issues have been solved by Arduino (from version 1.8.6 of the IDE) with a script to launch immediately after installing the IDE on the system. We suggest so to use the scripts contained in the Arduino package to install the software and fix these issues. After downloading the package from the official website, and extracting it, you should then run the following commands in a terminal to install the Arduino IDE on your Linux system: sudo .\/install.sh .\/arduino-linux-setup.sh $USER Known issues Heads up! The arduino-linux-setup.sh above will solve the issues of user permissions and sketch upload described below. If you are working with an old version of the IDE where this script is not present you can try to copy it from a new version or manually fix the issues as described below. User permissions Some Linux distributions need to be configured to gain upload permissions to the user to the Arduino tty port. If you find some complications in uploading the Arduino sketch(firmware) through the Arduino IDE, try to add your Linux user to the dialout group with this command: sudo usermod -a -G tty &lt;yourUserName&gt; sudo usermod -a -G dialout &lt;yourUserName&gt; where &lt;yourUserName&gt; is your Linux user name. You will need to log out and log in again for this change to take effect. Sketch upload ModemManager conflict If you have issues when trying to upload a sketch on the Arduino Leonardo-compatible ATmega32U4 of UDOO VISION you probably have a conflict with the program ModemManager (installed by default on many Linux distros like Ubuntu). Modem Manager tries to open any serial port (ttyACM0 of the Arduino Leonardo included) checking if it's a modem and this usually creates conflicts with the upload mechanism. If you have installed ModemManager on your Linux you can try to disable or uninstall it (https:\/\/askubuntu.com\/questions\/216114\/how-can-i-remove-modem-manager-from-boot) Since you probably don't have a modem on your UDOO VISION you can safely uninstall the package to solve the issue or disable it running the commands: sudo systemctl stop ModemManager.service sudo systemctl disable ModemManager.service After this procedure, you should be able to proceed normally and upload the sketch to your board or use the Serial Monitor. The solution of this issue was found in this thread of the Arduino Forum. How to restore the correct uploading state of sketches If you have not taken into account the possible conflict between ModemManager and sketch upload and you have not followed the instructions listed above, it may happen that the Arduino microcontroller is set in a state where the operating system does not see the serial port. This no longer allows you to load the sketch also using a different operating system. To exit from this state you can try to perform the procedure indicated by the Arduino Leonardo page. Pressing the Arduino physical reset button with the right timing it is possible to load a sketch when the serial port of the bootloader is exposed and restore the correct functioning of the ATmega32U4 microcontroller of Arduino Leonardo. Summarising, you need to hit the Arduino IDE Upload button and press the Arduino physical reset button with the right timing immediately after you see the message &quot;Uploading...&quot; appear in the software's status bar. Enable the verbose option of the Arduino IDE upload process can be very useful to understand when to correctly press the reset button . To do so, go to the menu File -&gt; Preference and check the upload option box in the &quot;Show verbose output during&quot; section. The correct time to press the reset button is when starts to appear PORT {} \/ {} =&gt; {} in the log. The IDE will see that port appear and perform the upload using it. Heads up! This won't work if something interferes with the board's USB communication so please, be sure to have resolved such issues as the conflict with ModemManager above.","tags":"","url":"Arduino_Leonardo_compatible(ATmega32U4)\/Getting_Started_with_Arduino_Leonardo.html"},{"title":"Pinout","text":"The embedded Arduino Leonardo-compatible input\/output (I\/O) pins operates at 5V, with a maximum 40 mA DC current per pin. They are located on the inner columns of the dual headers. Make sure to check this image to know where are the corresponding Pins Technical specs From the Arduino Leonardo page: Microcontroller ATmega32u4 Operating Voltage 5V Digital I\/O Pins 20 PWM Channels 7 Analog Input Channels 12 DC Current per I\/O Pin 40 mA DC Current for 3.3V Pin 50 mA Flash Memory 32 KB (ATmega32u4) of which 4 KB used by bootloader SRAM 2.5 KB (ATmega32u4) EEPROM 1 KB (ATmega32u4) Clock Speed 16 MHz Each of the 20 digital i\/o pins on the Leonardo can be used as an input or output, using pinMode(), digitalWrite(), and digitalRead() functions. They operate at 5 volts. Each pin can provide or receive a maximum of 40 mA and has an internal pull-up resistor (disconnected by default) of 20-50 kOhms. There are six analog input pins at 10-bit resolution, providing a range of 1024 values between ground and 3.3 V. The number of inputs and resolution can be increased if required, by using an external ADC module. The Leonardo has 12 analog inputs, labeled A0 through A11, and all can also be used as digital i\/o. Pins A0-A5 appear in the same locations as on the Uno; inputs A6-A11 are on digital i\/o pins 4, 6, 8, 9, 10, and 12 respectively. Each analog input provides 10 bits of resolution (i.e. 1024 different values). By default the analog inputs measure from ground to 5 volts, though it’s possible to change the upper end of their range using the AREF pin and the analogReference() function. There is a built-in LED connected to digital pin 13. When the pin is HIGH value, the LED is on, when the pin is LOW, it's off. Analog output is simulated using pulse width modulation (PWM) on digital pins 3, 5, 6, 8, 10, 11 and 13. For an explanation of PWM, refer to the following Arduino tutorial The pins 3 (interrupt 0), 2 (interrupt 1), 0 (interrupt 2), 1 (interrupt 3) and 7 (interrupt 4) can be configured to trigger an interrupt on a low value, a rising or falling edge, or a change in value. See the attachInterrupt() function for details.","tags":"","url":"Arduino_Leonardo_compatible(ATmega32U4)\/Pinout.html"},{"title":"UEFI Firmware","text":"UDOO VISION is supplied with American Megatrends International LLC(AMI)'s BIOS\/UEFI Firmware. It is possible to access to AMI Setup Utility by pressing the escape key (ESC) after System power up, during POST phase. Heads up! Some wireless or mechanical keyboards that doesn't respect the standard USB HID protocol could doesn't work in the UEFI BIOS Firmware menu. Warning! Please do NOT \"play\" with the BIOS-UEFI Firmware menu choices if you don't know what you are doing. For example, if you disable USB ports or Video Outputs you will not be able to interact with the BIOS-UEFI Firmware again to revert this condition. If you stumbling upon this case take a look at the Restore Factory configuration section below. Heads up! Since some resolutions or monitors are not managed well by the firmware, if you get a black screen when you try to enter in one of the UEFI Firmware Setup Utility Menu options, try using another Display with a 1920x1080 resolution or a different cable. UDOO VISION Hardware and UEFI BIOS User Manual For a complete explanation of the System Configuration Utility menu items you can download the exhaustive UDOO VISION Hardware and UEFI BIOS User Manual Restore Factory configuration In some cases, a wrong configuration of BIOS parameters could lead the module in an unusable state (i.e. no video output, all USB HID devices disabled). For these cases, on the module it has been placed a 3-way switch which can be used to restore the BIOS to factory default configuration. To do so, it is necessary to place the contact of the switch in 1-2 position, then turn on the module, wait until the board resets itself then turn off the module. The contact MUST be now placed back to 2-3 position. During normal use, the contact MUST be always placed in 2-3 position. You can restore the optimized factory default settings also from within the BIOS\/UEFI pressing the F3 key.","tags":"","url":"Advanced_Topics\/UEFI_Firmware.html"},{"title":"EAPI","text":"EAPI (Embedded Application Programming Interface) is a framework developed by PICMG® for COM Express modules that gives a common API to unify software control for: System information Watchdog timer I2C Bus Flat Panel brightness control User storage area GPIO The EAPI definition is open to be used for other embedded form factors too, such as SBCs. Read the full specification [here][https:\/\/www.picmg.org\/wp-content\/uploads\/COM_EAPI_R1_0.pdf]. The EAPI implementation for UDOO VISION can be found here for both Windows and Linux. As you can see here, the UDOO VISION doesn't have an official version by now but we are working to provide you a stable and tested release.","tags":"","url":"Advanced_Topics\/EAPI.html"}]}